RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_dsi.c
/*!
    \file    gd32h77x_78x_dsi.c
    \brief   DSI driver

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_78x_dsi.h"
#include <stdlib.h>

/*!
    \brief      deinitialize DSI registers (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dsi_deinit(void)
{
    rcu_periph_reset_enable(RCU_DSIRST);
    rcu_periph_reset_disable(RCU_DSIRST);
}

/*!
    \brief      initialize the DSI_Init structure with the default values (API_ID(0x0002U))
    \param[in]  none
    \param[out] dsi_init_struct: DSI Init parameter struct
    \retval     none
*/
void dsi_init_struct_para_init(dsi_init_parameter_struct *dsi_init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == dsi_init_struct) {
        fw_debug_report_err(DSI_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the struct parameters with default values */
        dsi_init_struct->lane_count = DSI_DATA_LANE_ONE;
        dsi_init_struct->mode_type = DSI_VIDEO_MODE;
        dsi_init_struct->video_mode_format = DSI_VIDEO_MODE_FORMAT_NONE;
        dsi_init_struct->color_format = DSI_VIDEO_MODE_FMT_RGB888;
        dsi_init_struct->data_width = DSI_CMD_MODE_DTW_8BIT;
        dsi_init_struct->cmd_size = 0U;
        dsi_init_struct->virtual_channel = DSI_VIRTUAL_CHANNEL_0;
        dsi_init_struct->polarity = DSI_VSYNC_POLARITY;
    }
}

/*!
    \brief      initialize the DSI host according to the specified parameters in the dsi_init_struct (API_ID(0x0003U))
    \param[in]  dsi_init_struct: DSI Init parameter struct
                  lane_count: number of active data lanes, possible values are:
                    DSI_DATA_LANE_ONE: one data lane
                    DSI_DATA_LANE_TWO: two data lanes
                  mode_type: video mode or command mode, possible values are:
                    DSI_VIDEO_MODE: video mode
                    DSI_COMMAND_MODE: command mode
                  video_mode_format: video mode format for video mode, possible values are:
                    DSI_VIDEO_MODE_FORMAT_NONE: none video mode format
                    DSI_NON_BURST_MODE_SYNC_PULSE: non burst mode with sync pulse
                    DSI_NON_BURST_MODE_SYNC_EVENTS: non burst mode with sync events
                    DSI_BURST_MODE: burst mode
                  color_format: color format for video mode, possible values are:
                    DSI_VIDEO_MODE_FMT_RGB565: RGB565 or 16-bit format
                    DSI_VIDEO_MODE_FMT_RGB666: RGB666 or 18-bit format
                    DSI_VIDEO_MODE_FMT_RGB666LP: RGB666 loosely packed format
                    DSI_VIDEO_MODE_FMT_RGB888: RGB888 or 24-bit format
                  data_width: data width for command mode
                    DSI_CMD_MODE_DTW_8BIT: 8-bit data width
                    DSI_CMD_MODE_DTW_16BIT: 16-bit data width
                    DSI_CMD_MODE_DTW_24BIT: 24-bit data width
                  cmd_size: DSI command size (used only in command mode)
                  virtual_channel: virtual channel ID, possible values are:
                    DSI_VIRTUAL_CHANNEL_0: virtual channel 0
                    DSI_VIRTUAL_CHANNEL_1: virtual channel 1
                    DSI_VIRTUAL_CHANNEL_2: virtual channel 2
                    DSI_VIRTUAL_CHANNEL_3: virtual channel 3
                  polarity: polarity configuration, possible values are:
                    DSI_VSYNC_POLARITY: vsync
                    DSI_HSYNC_POLARITY: hsync
                    DSI_SHUTDOWN_POLARITY: shutdown
                    DSI_COLOR_MODE_POLARITY: color mode
    \param[out] none
    \retval     none
*/
void dsi_init(dsi_init_parameter_struct *dsi_init_struct)
{
    uint32_t reg_val;

#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == dsi_init_struct) {
        fw_debug_report_err(DSI_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure FUNCPRG register: set data lanes, virtual channel and color format based on mode type */
        reg_val = DSI_FUNCPRG;
        reg_val &= ~(DSI_FUNCPRG_DTLANE_PRG | DSI_FUNCPRG_VCHNUMCM | DSI_FUNCPRG_SFMTVM | DSI_FUNCPRG_SDTWCM);
        reg_val |= dsi_init_struct->lane_count;

        if(DSI_COMMAND_MODE == dsi_init_struct->mode_type) {
            /* For command mode:
               - clear VCHNUMCM and set virtual channel in VCHNUMCM
               - clear SFMTVM (set to 0 for command mode)
               - set supported data width in command mode */
            reg_val |= (((dsi_init_struct->virtual_channel & 0x3U) << 5) | dsi_init_struct->data_width); /* VCHNUMCM is at bits 5-6 */
            /* clear video mode format */
            DSI_VMFMT &= ~DSI_VMFMT_VMFMT;
        } else {
            /* For video mode:
               - clear VCHNUMVM and set virtual channel in VCHNUMVM
               - clear SFMTVM and set color format in SFMTVM */
            reg_val |= ((dsi_init_struct->virtual_channel & 0x3U) << 3 | dsi_init_struct->color_format);
            /* set video mode format */
            DSI_VMFMT = dsi_init_struct->video_mode_format;
        }

        DSI_FUNCPRG = reg_val;

        /* set polarity configuration */
        reg_val = DSI_PLCTL;
        reg_val &= ~DSI_PLCTL_PL;
        reg_val |= dsi_init_struct->polarity;
        DSI_PLCTL = reg_val;

        /* set command size */
        if(DSI_COMMAND_MODE == dsi_init_struct->mode_type) {
            DSI_DCSWC = dsi_init_struct->cmd_size;
        }
    }
}

/*!
    \brief      set the DSI host device ready state (API_ID(0x0004U))
    \param[in]  ready_state
                only one parameter can be selected which is shown as below:
      \arg        DSI_DEVICE_NOT_READY: not ready
      \arg        DSI_DEVICE_READY: ready
    \param[out] none
    \retval     none
*/
void dsi_device_ready_set(uint32_t ready_state)
{
    uint32_t reg_val;

    reg_val = DSI_DEVRDY;
    reg_val &= ~DSI_DEVRDY_DEVRDY;
    reg_val |= ready_state & DSI_DEVRDY_DEVRDY;
    DSI_DEVRDY = reg_val;
}

/*!
    \brief      set the ULPS state (API_ID(0x0005U))
    \param[in]  ulps_mode
                only one parameter can be selected which is shown as below:
      \arg        DSI_ULPS_NORMAL_OPERATION: normal operation
      \arg        DSI_ULPS_EXIT_MODE: ultra low power EXIT mode
      \arg        DSI_ULPS_POWER_SAVING_MODE: ultra low power [POWER SAVING] mode
    \param[out] none
    \retval     none
*/
void dsi_ulps_mode_set(uint32_t ulps_mode)
{
    uint32_t reg_val;

    reg_val = DSI_DEVRDY;
    reg_val &= ~DSI_DEVRDY_ULPS_STATE;
    reg_val |= ulps_mode & DSI_DEVRDY_ULPS_STATE;
    DSI_DEVRDY = reg_val;
}

/*!
    \brief      control display bus possession, (API_ID(0x0006U))
    \param[in]  bus_pos
                only one parameter can be selected which is shown as below:
      \arg        DSI_BUS_POSSESSION_STOP: stop the display bus possession of the DSI receive
      \arg        DSI_BUS_POSSESSION_RECEIVE: inform that DSI receiver has to be given bus possession for receiving the tearing effect trigger message
    \param[out] none
    \retval     none
*/
void dsi_display_bus_possession_set(uint32_t bus_pos)
{
    uint32_t reg_val;

    reg_val = DSI_DEVRDY;
    reg_val &= ~DSI_DEVRDY_BUS_POSS;
    reg_val |= bus_pos & DSI_DEVRDY_BUS_POSS;
    DSI_DEVRDY = reg_val;
}

/*!
    \brief      configure the DSI low power byte clock (API_ID(0x0007U))
    \param[in]  byte_clk: LP clock equivalence in terms of byte clock (0-65535)
    \param[out] none
    \retval     none
*/
void dsi_lp_byte_clk_config(uint16_t byte_clk)
{
    DSI_LPBCLKCFG = (uint32_t)(byte_clk & DSI_LPBCLKCFG_LPBYTECLK);
}

/*!
    \brief      initialize DSI horizontal and vertical count structure with the default values (API_ID(0x0008U))
    \param[in]  none
    \param[out] hv_count: DSI horizontal and vertical count struct
    \retval     none
*/
void dsi_hv_count_struct_para_init(dsi_hv_count_struct *hv_count)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == hv_count) {
        fw_debug_report_err(DSI_MODULE_ID, API_ID(0x0008U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the horizontal and vertical count parameters with default values */
        hv_count->hsa_count = 0U;
        hv_count->hbp_count = 0U;
        hv_count->hfp_count = 0U;
        hv_count->hac_count = 0U;
        hv_count->vsa_count = 0U;
        hv_count->vbp_count = 0U;
        hv_count->vfp_count = 0U;
    }
}

/*!
    \brief      configure the DSI for video mode with complete timing parameters (API_ID(0x0009U))
    \param[in]  hv_count: DSI horizontal and vertical count struct
                  hsa_count: horizontal sync active count
                  hbp_count: horizontal back porch count
                  hfp_count: horizontal front porch count
                  hac_count: horizontal active count
                  vsa_count: vertical sync active count
                  vbp_count: vertical back porch count
                  vfp_count: vertical front porch count
    \param[out] none
    \retval     none
*/
void dsi_hv_count_config(dsi_hv_count_struct *hv_count)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == hv_count) {
        fw_debug_report_err(DSI_MODULE_ID, API_ID(0x0009U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure horizontal timing parameters */
        DSI_HSACFG = (uint32_t)(hv_count->hsa_count & DSI_HSACFG_HSACNT);
        DSI_HBPCFG = (uint32_t)(hv_count->hbp_count & DSI_HBPCFG_HBPCNT);
        DSI_HFPCFG = (uint32_t)(hv_count->hfp_count & DSI_HFPCFG_HFPCNT);
        DSI_HACFG = (uint32_t)(hv_count->hac_count & DSI_HACFG_HACNT);

