RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_dsi.c
    reg_val = DSI_CKEOTCTL;
    reg_val &= ~DSI_CKEOTCTL_EOTDIS;
    DSI_CKEOTCTL = reg_val;
}

/*!
    \brief      disable EOT packet transmission ((API_ID(0x0025U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dsi_eot_transmission_disable(void)
{
    uint32_t reg_val;

    reg_val = DSI_CKEOTCTL;
    reg_val |= DSI_CKEOTCTL_EOTDIS;
    DSI_CKEOTCTL = reg_val;
}

/*!
    \brief      enable clock stopping feature (API_ID(0x0026U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dsi_clock_stopping_enable(void)
{
    uint32_t reg_val;

    reg_val = DSI_CKEOTCTL;
    reg_val |= DSI_CKEOTCTL_CKSTOP;
    DSI_CKEOTCTL = reg_val;
}

/*!
    \brief      disable clock stopping feature (API_ID(0x0027U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dsi_clock_stopping_disable(void)
{
    uint32_t reg_val;

    reg_val = DSI_CKEOTCTL;
    reg_val &= ~DSI_CKEOTCTL_CKSTOP;
    DSI_CKEOTCTL = reg_val;
}

/*!
    \brief      enable video BTA (API_ID(0x0028U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dsi_video_bta_enable(void)
{
    uint32_t reg_val;

    reg_val = DSI_CKEOTCTL;
    reg_val &= ~DSI_CKEOTCTL_VBTADIS;
    DSI_CKEOTCTL = reg_val;
}

/*!
    \brief      disable video BTA (API_ID(0x0029U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dsi_video_bta_disable(void)
{
    uint32_t reg_val;

    reg_val = DSI_CKEOTCTL;
    reg_val |= DSI_CKEOTCTL_VBTADIS;
    DSI_CKEOTCTL = reg_val;
}

/*!
    \brief      configure HS to LP switching counter for clock lane (API_ID(0x002AU))
    \param[in]  count: HS to LP switching count value
    \param[out] none
    \retval     none
*/
void dsi_clk_hs_to_lp_switch_count_set(uint16_t count)
{
    uint32_t reg_val;

    reg_val = DSI_CKLSWCFG;
    reg_val &= ~DSI_CKLSWCFG_HSLPSW;
    reg_val |= (uint32_t)count & DSI_CKLSWCFG_HSLPSW;
    DSI_CKLSWCFG = reg_val;
}

/*!
    \brief      configure LP to HS switching counter for clock lane (API_ID(0x002BU))
    \param[in]  count: LP to HS switching count value
    \param[out] none
    \retval     none
*/
void dsi_clk_lp_to_hs_switch_count_set(uint16_t count)
{
    uint32_t reg_val;

    reg_val = DSI_CKLSWCFG;
    reg_val &= ~DSI_CKLSWCFG_LPHSSW;
    reg_val |= ((uint32_t)count << 16U) & DSI_CKLSWCFG_LPHSSW;
    DSI_CKLSWCFG = reg_val;
}

/*!
    \brief      configure data lane switching counter (API_ID(0x002CU))
    \param[in]  count: data lane switching count value
    \param[out] none
    \retval     none
*/
void dsi_data_lane_switch_count_set(uint16_t count)
{
    DSI_DLCFG = (uint32_t)(count & DSI_DLCFG_DLCFG);
}

/*!
    \brief      initialize DSI DPHY parameter structure with default values (API_ID(0x002DU))
    \param[in]  none
    \param[out] dphy_struct: DSI DPHY parameter struct
    \retval     none
*/
void dsi_dphy_struct_para_init(dsi_dphy_parameter_struct *dphy_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == dphy_struct) {
        fw_debug_report_err(DSI_MODULE_ID, API_ID(0x002DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the DPHY parameters with default values */
        dphy_struct->hs_prepare = 0U;
        dphy_struct->hs_zero = 0U;
        dphy_struct->hs_trail = 0U;
        dphy_struct->hs_exit = 0U;
        dphy_struct->clk_prepare = 0U;
        dphy_struct->clk_zero = 0U;
        dphy_struct->clk_trail = 0U;
        dphy_struct->clk_exit = 0U;
    }
}

/*!
    \brief      configure the DPHY parameters (API_ID(0x002EU))
    \param[in]  dphy_struct: DSI DPHY parameter struct
                  hs_prepare: HS preparation time
                  hs_zero: HS zero time
                  hs_trail: HS trail time
                  hs_exit: HS exit time
                  clk_prepare: CLK preparation time
                  clk_zero: CLK zero time
                  clk_trail: CLK trail time
                  clk_exit: CLK exit time
    \param[out] none
    \retval     none
*/
void dsi_dphy_config(dsi_dphy_parameter_struct *dphy_struct)
{
    uint32_t reg_val_pcfg = 0U;
    uint32_t reg_val_cltmpcfg = 0U;

#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == dphy_struct) {
        fw_debug_report_err(DSI_MODULE_ID, API_ID(0x002EU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure DPHY parameters */
        reg_val_pcfg = ((uint32_t)dphy_struct->hs_prepare) |
                       ((uint32_t)dphy_struct->hs_zero << 8U) |
                       ((uint32_t)dphy_struct->hs_trail << 16U) |
                       ((uint32_t)dphy_struct->hs_exit << 24U);

        reg_val_cltmpcfg = ((uint32_t)dphy_struct->clk_prepare) |
                           ((uint32_t)dphy_struct->clk_zero << 8U) |
                           ((uint32_t)dphy_struct->clk_trail << 16U) |
                           ((uint32_t)dphy_struct->clk_exit << 24U);

        DSI_DPHY_PCFG = reg_val_pcfg;
        DSI_DPHY_CLTMPCFG = reg_val_cltmpcfg;
    }
}

/*!
    \brief      configure the PLL counter value (API_ID(0x002FU))
    \param[in]  counter_value: PLL counter value in terms of low power clock (0-65535)
    \param[out] none
    \retval     none
*/
void dsi_dphy_pll_counter_set(uint16_t counter_value)
{
    DSI_DPHY_PLLLK = (uint32_t)(counter_value & DSI_DPHY_PLLLK_PLLCNTVAL);
}

/*!
    \brief      set HS preparation time (API_ID(0x0030U))
    \param[in]  hs_prepare: HS preparation time
    \param[out] none
    \retval     none
*/
void dsi_dphy_hs_prepare_time_set(uint8_t hs_prepare)
{
    uint32_t reg_val;

    reg_val = DSI_DPHY_PCFG;
    reg_val &= ~DSI_DPHY_PCFG_HS_PREP;
    reg_val |= (uint32_t)hs_prepare & DSI_DPHY_PCFG_HS_PREP;
    DSI_DPHY_PCFG = reg_val;
}

/*!
    \brief      set HS zero time (API_ID(0x0031U))
    \param[in]  hs_zero: HS zero time
    \param[out] none
    \retval     none
*/
void dsi_dphy_hs_zero_time_set(uint8_t hs_zero)
{
    uint32_t reg_val;

    reg_val = DSI_DPHY_PCFG;
    reg_val &= ~DSI_DPHY_PCFG_HS_ZERO;
    reg_val |= ((uint32_t)hs_zero << 8U) & DSI_DPHY_PCFG_HS_ZERO;
    DSI_DPHY_PCFG = reg_val;
}

/*!
    \brief      set HS trail time (API_ID(0x0032U))
    \param[in]  hs_trail: HS trail time
    \param[out] none
    \retval     none
*/
void dsi_dphy_hs_trail_time_set(uint8_t hs_trail)
{
    uint32_t reg_val;

