RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_dsi.c
    reg_val = DSI_DPHY_PCFG;
    reg_val &= ~DSI_DPHY_PCFG_HS_TRAIL;
    reg_val |= ((uint32_t)hs_trail << 16) & DSI_DPHY_PCFG_HS_TRAIL;
    DSI_DPHY_PCFG = reg_val;
}

/*!
    \brief      set HS exit time (API_ID(0x0033U))
    \param[in]  hs_exit: HS exit time
    \param[out] none
    \retval     none
*/
void dsi_dphy_hs_exit_time_set(uint8_t hs_exit)
{
    uint32_t reg_val;

    reg_val = DSI_DPHY_PCFG;
    reg_val &= ~DSI_DPHY_PCFG_HS_EXIT;
    reg_val |= ((uint32_t)hs_exit << 24U) & DSI_DPHY_PCFG_HS_EXIT;
    DSI_DPHY_PCFG = reg_val;
}

/*!
    \brief      set clock preparation time (API_ID(0x0034U))
    \param[in]  clk_prepare: CLK preparation time
    \param[out] none
    \retval     none
*/
void dsi_dphy_clk_prepare_time_set(uint8_t clk_prepare)
{
    uint32_t reg_val;

    reg_val = DSI_DPHY_CLTMPCFG;
    reg_val &= ~DSI_DPHY_CLTMPCFG_CLK_PREP;
    reg_val |= (uint32_t)clk_prepare & DSI_DPHY_CLTMPCFG_CLK_PREP;
    DSI_DPHY_CLTMPCFG = reg_val;
}

/*!
    \brief      set clock zero time (API_ID(0x0035U))
    \param[in]  clk_zero: CLK zero time
    \param[out] none
    \retval     none
*/
void dsi_dphy_clk_zero_time_set(uint8_t clk_zero)
{
    uint32_t reg_val;

    reg_val = DSI_DPHY_CLTMPCFG;
    reg_val &= ~DSI_DPHY_CLTMPCFG_CLK_ZERO;
    reg_val |= ((uint32_t)clk_zero << 8U) & DSI_DPHY_CLTMPCFG_CLK_ZERO;
    DSI_DPHY_CLTMPCFG = reg_val;
}

/*!
    \brief      set clock trail time (API_ID(0x0036U))
    \param[in]  clk_trail: CLK trail time
    \param[out] none
    \retval     none
*/
void dsi_dphy_clk_trail_time_set(uint8_t clk_trail)
{
    uint32_t reg_val;

    reg_val = DSI_DPHY_CLTMPCFG;
    reg_val &= ~DSI_DPHY_CLTMPCFG_CLK_TRAIL;
    reg_val |= ((uint32_t)clk_trail << 16U) & DSI_DPHY_CLTMPCFG_CLK_TRAIL;
    DSI_DPHY_CLTMPCFG = reg_val;
}

/*!
    \brief      set clock exit time (API_ID(0x0037U))
    \param[in]  clk_exit: CLK exit time
    \param[out] none
    \retval     none
*/
void dsi_dphy_clk_exit_time_set(uint8_t clk_exit)
{
    uint32_t reg_val;

    reg_val = DSI_DPHY_CLTMPCFG;
    reg_val &= ~DSI_DPHY_CLTMPCFG_CLK_EXIT;
    reg_val |= ((uint32_t)clk_exit << 24U) & DSI_DPHY_CLTMPCFG_CLK_EXIT;
    DSI_DPHY_CLTMPCFG = reg_val;
}

/*!
    \brief      enable control reset to the digital front end (API_ID(0x0038U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dsi_dphy_dfe_reset_enable(void)
{
    DSI_DPHY_RSTENDFE = DSI_DPHY_RSTENDFE_RSTENDFE;
}

/*!
    \brief      disable control reset to the digital front end (API_ID(0x0039U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dsi_dphy_dfe_reset_disable(void)
{
    DSI_DPHY_RSTENDFE = 0U;
}

/*!
    \brief      configure DPHY trim settings (API_ID(0x003AU))
    \param[in]  trim0: trim control 0 value
    \param[in]  trim1: trim control 1 value
    \param[in]  trim2: trim control 2 value
    \param[out] none
    \retval     none
*/
void dsi_dphy_trim_config(uint32_t trim0, uint32_t trim1, uint32_t trim2)
{
    DSI_DPHY_TRIMCTL0 = trim0;
    DSI_DPHY_TRIMCTL1 = trim1;
    DSI_DPHY_TRIMCTL2 = trim2;
}

/*!
    \brief      set specific DPHY trim control 0 parameter (API_ID(0x003BU))
    \param[in]  value: value to set for the trim parameter
    \param[out] none
    \retval     none
*/
void dsi_dphy_trim_control0_set(uint32_t value)
{
    DSI_DPHY_TRIMCTL0 = value;
}

/*!
    \brief      set specific DPHY trim control 1 parameter (API_ID(0x003CU))
    \param[in]  value: value to set for the trim parameter
    \param[out] none
    \retval     none
*/
void dsi_dphy_trim_control1_set(uint32_t value)
{
    DSI_DPHY_TRIMCTL1 = value;
}

/*!
    \brief      set specific DPHY trim control 2 parameter (API_ID(0x003DU))
    \param[in]  value: value to set for the trim parameter
    \param[out] none
    \retval     none
*/
void dsi_dphy_trim_control2_set(uint32_t value)
{
    DSI_DPHY_TRIMCTL2 = value;
}

/*!
    \brief      enable/disable deskew calibration (API_ID(0x003EU))
    \param[in]  state: deskew calibration state
                only one parameter can be selected which is shown as below:
      \arg        DSI_DESKEW_DISABLE: disable deskew calibration
      \arg        DSI_INIT_DESKEW_ENABLE: enable init deskew calibration
      \arg        DSI_PERIODIC_DESKEW_ENABLE: enable periodic deskew calibration
    \param[out] none
    \retval     none
*/
void dsi_deskew_calibration_config(uint32_t state)
{
    uint32_t reg_val;

    reg_val = DSI_DSKCTL;
    reg_val &= ~DSI_DSKCTL_DSKCALIB;
    reg_val |= state & DSI_DSKCTL_DSKCALIB;
    DSI_DSKCTL = reg_val;
}

/*!
    \brief      set deskew duration (API_ID(0x003FU))
    \param[in]  duration: deskew duration value
    \param[out] none
    \retval     none
*/
void dsi_deskew_duration_set(uint16_t duration)
{
    uint32_t reg_val;

    reg_val = DSI_DSKCTL;
    reg_val &= ~DSI_DSKCTL_DSKDUR;
    reg_val |= ((uint32_t)duration << 2U) & DSI_DSKCTL_DSKDUR;
    DSI_DSKCTL = reg_val;
}

/*!
    \brief      set deskew periodic timer (API_ID(0x0040U))
    \param[in]  period: periodic deskew timer value
    \param[out] none
    \retval     none
*/
void dsi_deskew_timer_set(uint16_t period)
{
    DSI_DSKTM = (uint32_t)(period & DSI_DSKTM_DSKTM);
}

/*!
    \brief      get deskew calibration in progress status (API_ID(0x0041U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus dsi_deskew_in_progress_status_get(void)
{
    return (DSI_DSKSTAT & DSI_DSKSTAT_DSKIP) ? SET : RESET;
}

/*!
    \brief      enable error auto recovery options (API_ID(0x0042U))
    \param[in]  recovery_options
                one or more parameters can be selected which are shown as below:
      \arg        DSI_ERR_AUTO_REC_ECC_MUL: ECC multiple error recovery
      \arg        DSI_ERR_AUTO_REC_INVLD_DT: invalid data error recovery
      \arg        DSI_ERR_AUTO_REC_HI_CONT: high contention error recovery
      \arg        DSI_ERR_AUTO_REC_LO_CONT: low contention error recovery
      \arg        DSI_ERR_AUTO_REC_HS_RX_TO: HS RX timeout error recovery
      \arg        DSI_ERR_AUTO_REC_LP_RX_TO: LP RX timeout error recovery
    \param[out] none
    \retval     none
*/
void dsi_error_auto_recovery_enable(uint32_t recovery_options)
{
    DSI_EARCTL |= recovery_options;
}

/*!
    \brief      disable error auto recovery options (API_ID(0x0043U))
    \param[in]  recovery_options
                one or more parameters can be selected which are shown as below:
      \arg        DSI_ERR_AUTO_REC_ECC_MUL: ECC multiple error recovery
      \arg        DSI_ERR_AUTO_REC_INVLD_DT: invalid data error recovery
      \arg        DSI_ERR_AUTO_REC_HI_CONT: high contention error recovery
      \arg        DSI_ERR_AUTO_REC_LO_CONT: low contention error recovery
      \arg        DSI_ERR_AUTO_REC_HS_RX_TO: HS RX timeout error recovery
      \arg        DSI_ERR_AUTO_REC_LP_RX_TO: LP RX timeout error recovery
    \param[out] none
    \retval     none
*/
void dsi_error_auto_recovery_disable(uint32_t recovery_options)
{
    DSI_EARCTL &= (uint32_t)~recovery_options;
}

/*!
    \brief      get difference in one line time between DPI and DSI (API_ID(0x0044U))
    \param[in]  none
    \param[out] none
    \retval     difference value in one line time
*/
uint16_t dsi_dpi_difference_get(void)
{
    return (uint16_t)((DSI_MIPIDIRDPISTAT & DSI_MIPIDIRDPISTAT_DPI_DIFF) >> 16);
}

/*!
    \brief      get DPI line time is greater or DSI line time is greater (API_ID(0x0045U))
    \param[in]  none
    \param[out] none
    \retval     line time status
*/
uint32_t dsi_dpi_line_time_status_get(void)
{
    return (uint32_t)((DSI_MIPIDIRDPISTAT & DSI_MIPIDIRDPISTAT_DPI_HI) >> 15);
}

/*!
    \brief      get MIPI BUS direction (API_ID(0x0046U))
    \param[in]  none
    \param[out] none
    \retval     MIPI bus direction
*/
uint32_t dsi_mipi_bus_direction_get(void)
{
    return (DSI_MIPIDIRDPISTAT & DSI_MIPIDIRDPISTAT_MIPI_DIR);
}

/*!
    \brief      set DDR frequency mode (API_ID(0x0047U))
    \param[in]  freq_mode: DDR frequency mode
                only one parameter can be selected which is shown as below:
      \arg        DDR_FREQ_LT_200MHZ: DDR freq < 200MHz
      \arg        DDR_FREQ_GT_EQ_200MHZ: DDR freq >= 200MHz
    \param[out] none
    \retval     none
*/
void dsi_ddr_freq_mode_set(uint32_t freq_mode)
{
    DSI_FMCTL = freq_mode;
}

/*!
    \brief      set TX data width (API_ID(0x0048U))
    \param[in]  width: TX data width value (0-255)
    \param[out] none
    \retval     none
*/
void dsi_tx_data_width_set(uint8_t width)
{
    DSI_TXDTWCFG = (uint32_t)width & DSI_TXDTWCFG_TXDTWIDTH;
}

/*!
    \brief      set LP control parameters (API_ID(0x0049U))
    \param[in]  data_type: data type (0-63)
    \param[in]  virtual_channel: virtual channel (0-3)
    \param[in]  word_count: word count
    \param[out] none
    \retval     none
*/
void dsi_lp_control_set(uint8_t data_type, uint8_t virtual_channel, uint32_t word_count)
{
    uint32_t reg_val = 0U;

    reg_val = ((uint32_t)data_type & 0x3FU) |
              (((uint32_t)virtual_channel & 0x3U) << 6U) |
              (((uint32_t)word_count & 0xFFFFU) << 8U);

    DSI_LPCTL = reg_val;
}

/*!
    \brief      set HS control parameters (API_ID(0x004AU))
    \param[in]  data_type: data type (0-63)
    \param[in]  virtual_channel: virtual channel
      \arg        DSI_VIRTUAL_CHANNEL_0
      \arg        DSI_VIRTUAL_CHANNEL_1
      \arg        DSI_VIRTUAL_CHANNEL_2
      \arg        DSI_VIRTUAL_CHANNEL_3
    \param[in]  word_count: word count
    \param[out] none
    \retval     none
*/
void dsi_hs_control_set(uint8_t data_type, uint8_t virtual_channel, uint32_t word_count)
{
    uint32_t reg_val = 0U;

    reg_val = ((uint32_t)data_type & 0x3FU) |
              (((uint32_t)virtual_channel & 0x3U) << 6U) |
              (((uint32_t)word_count & 0xFFFFU) << 8U);

    DSI_HSCTL = reg_val;
}

/*!
    \brief      write data to LP data register (API_ID(0x004BU))
    \param[in]  data: data used for Generic/DCS data transfers in low power mode
    \param[out] none
    \retval     none
*/
void dsi_lp_data_write(uint32_t data)
{
    DSI_LPDATA = data & DSI_LPDATA_LPDATA;
}

/*!
    \brief      read data to LP data register (API_ID(0x0071U))
    \param[in]  none
    \param[out] none
    \retval     data used for Generic/DCS data transfers in low power mode
*/
uint32_t dsi_lp_data_read(void)
{
    return DSI_LPDATA;
}

/*!
    \brief      write data to HS data register (API_ID(0x004CU))
    \param[in]  data: data used for Generic/DCS data transfers in high-speed mode
    \param[out] none
    \retval     none
*/
void dsi_hs_data_write(uint32_t data)
{
    DSI_HSDATA = data & DSI_HSDATA_HSDATA;
}

/*!
    \brief      write data to HS data register (API_ID(0x0072U))
    \param[in]  none
    \param[out] none
    \retval     data used for Generic/DCS data transfers in high-speed mode
*/
uint32_t dsi_hs_data_read(void)
{
    return DSI_HSDATA;
}

/*!
    \brief      set DCS word count (API_ID(0x004DU))
    \param[in]  count: DCS word count value
    \param[out] none
    \retval     none
*/
void dsi_dcs_word_count_set(uint16_t count)
{
    DSI_DCSWC = (uint32_t)(count & DSI_DCSWC_DCSWC);
}

/*!
    \brief      select high-speed or low-power mode for the next transmission packet (API_ID(0x004EU))
    \param[in]  mode: transmission mode
                only one parameter can be selected which is shown as below:
      \arg        DSI_TRANSFER_HS: high-speed transfer
      \arg        DSI_TRANSFER_LP: low-power transfer
    \param[out] none
    \retval     none
*/
void dsi_transfer_mode_set(uint32_t mode)
{
    uint32_t reg_val;

    reg_val = DSI_MAXRPKTCTL;
    reg_val &= ~DSI_MAXRPKTCTL_HS_LP;
    reg_val |= mode & DSI_MAXRPKTCTL_HS_LP;
    DSI_MAXRPKTCTL = reg_val;
}

/*!
    \brief      set TE polarity (API_ID(0x0051U))
    \param[in]  polarity: TE pin polarity,
                only one parameter can be selected which is shown as below:
      \arg        DSI_TE_POL_RISING_EDGE: TE pin polarity is rising edge
      \arg        DSI_TE_POL_FALLING_EDGE: TE pin polarity is falling edge
    \param[out] none
    \retval     none
*/
void dsi_wrapper_te_polarity_set(uint32_t polarity)
{
    uint32_t reg_val;

