RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_dsi.c
    reg_val = DSI_WCTL;
    reg_val &= ~DSI_WCTL_TEPOL;
    reg_val |= polarity & DSI_WCTL_TEPOL;
    DSI_WCTL = reg_val;
}

/*!
    \brief      enable or disable TLI DMA mode (API_ID(0x0052U))
    \param[in]  tli_dma: TLI DMA mode configuration
                only one parameter can be selected which is shown as below:
      \arg        DSI_TLI_DMA_MODE_DISABLE: DMA mode disable, DMA used by TLI
      \arg        DSI_TLI_DMA_MODE_ENABLE: DMA mode enable, DMA used by DSI
    \param[out] none
    \retval     none
*/
void dsi_wrapper_tli_dma_mode_config(uint32_t tli_dma)
{
    uint32_t reg_val;

    reg_val = DSI_WCTL;
    reg_val &= ~DSI_WCTL_TLIDMA;
    reg_val |= tli_dma & DSI_WCTL_TLIDMA;
    DSI_WCTL = reg_val;
}

/*!
    \brief      set TE source (API_ID(0x0053U))
    \param[in]  source: TE source configuration
                only one parameter can be selected which is shown as below:
      \arg        DSI_TE_EXTERNAL_PIN: external TE source
      \arg        DSI_TE_DSI_LINK: DSI packet TE source
    \param[out] none
    \retval     none
*/
void dsi_wrapper_te_source_set(uint32_t source)
{
    uint32_t reg_val;

    reg_val = DSI_WCTL;
    reg_val &= ~DSI_WCTL_TESRC;
    reg_val |= source & DSI_WCTL_TESRC;
    DSI_WCTL = reg_val;
}

/*!
    \brief      enable or disable automatic refresh mode (API_ID(0x0054U))
    \param[in]  auto_ref_mod: automatic refresh mode configuration
                only one parameter can be selected which is shown as below:
      \arg        DSI_AUTO_REFRESH_MODE_DISABLE: Automatic refresh mode disable
      \arg        DSI_AUTO_REFRESH_MODE_ENABLE: Automatic refresh mode enable
    \param[out] none
    \retval     none
*/
void dsi_wrapper_auto_refresh_mode_config(uint32_t auto_ref_mod)
{
    uint32_t reg_val;

    reg_val = DSI_WCTL;
    reg_val &= ~DSI_WCTL_ARM;
    reg_val |= auto_ref_mod & DSI_WCTL_ARM;
    DSI_WCTL = reg_val;
}

/*!
    \brief      refresh command FIFO buffer (API_ID(0x0055U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dsi_wrapper_cmd_fifo_buffer_refresh(void)
{
    DSI_WCTL |= DSI_WCTL_RBUF;
}

/*!
    \brief      enable or disable hardware auto refresh cmd buffer (API_ID(0x0056U))
    \param[in]  auto_ref_buf: hardware auto refresh buffer configuration
                only one parameter can be selected which is shown as below:
      \arg        DSI_AUTO_REFRESH_BUF_DISABLE: No auto-refresh of cmd FIFO
      \arg        DSI_AUTO_REFRESH_BUF_ENABLE: Auto-refresh cmd FIFO
    \param[out] none
    \retval     none
*/
void dsi_wrapper_auto_refresh_buffer_config(uint32_t auto_ref_buf)
{
    uint32_t reg_val;

    reg_val = DSI_WCTL;
    reg_val &= ~DSI_WCTL_ARBUF;
    reg_val |= auto_ref_buf & DSI_WCTL_ARBUF;
    DSI_WCTL = reg_val;
}

/*!
    \brief      set RGB data format (API_ID(0x0057U))
    \param[in]  format: RGB format configuration
                only one parameter can be selected which is shown as below:
      \arg        DSI_TLI_DATA_FORMAT_RGB565: RGB565 format
      \arg        DSI_TLI_DATA_RGB888: RGB888 format
      \arg        DSI_TLI_DATA_RGB888_TO_RGB666: RGB888 to RGB666 format
      \arg        DSI_TLI_DATA_RGB565_TO_RGB666: RGB565 to RGB666 format
    \param[out] none
    \retval     none
*/
void dsi_wrapper_rgb_format_set(uint32_t format)
{
    DSI_WRGBDF &= ~DSI_WRGBDF_TLI_DF;
    DSI_WRGBDF |= format & DSI_WRGBDF_TLI_DF;
}

/*!
    \brief      select HS command mode data source (API_ID(0x0058U))
    \param[in]  source: HS command mode data source
                only one parameter can be selected which is shown as below:
      \arg        DSI_HS_DATASRC_HSDATA: From DSI_HSDATA(0x104)
      \arg        DSI_HS_DATASRC_TLI_DMA: From TLI DMA
    \param[out] none
    \retval     none
*/
void dsi_wrapper_hs_cmd_data_source_set(uint32_t source)
{
    uint32_t reg_val;

    reg_val = DSI_WCMDDS;
    reg_val &= ~DSI_WCMDDS_HSCMDDS;
    reg_val |= source & DSI_WCMDDS_HSCMDDS;
    DSI_WCMDDS = reg_val;
}

/*!
    \brief      select LP command mode data source (API_ID(0x0059U))
    \param[in]  source: LP command mode data source
                only one parameter can be selected which is shown as below:
      \arg        DSI_LP_DATASRC_LPDATA: From DSI_LPDATA(0xFC)
      \arg        DSI_LP_DATASRC_TLI_DMA: From TLI DMA
    \param[out] none
    \retval     none
*/
void dsi_wrapper_lp_cmd_data_source_set(uint32_t source)
{
    uint32_t reg_val;

    reg_val = DSI_WCMDDS;
    reg_val &= ~DSI_WCMDDS_LPCMDDS;
    reg_val |= source & DSI_WCMDDS_LPCMDDS;
    DSI_WCMDDS = reg_val;
}

/*!

    \brief      select the DMA request source for command mode data (API_ID(0x005AU))
    \param[in]  source: DMA request source
                only one parameter can be selected which is shown as below:
      \arg        DSI_DMA_REQ_SRC_HSDTFIFOHE: DMA request source select HSDTFIFOHE
      \arg        DSI_DMA_REQ_SRC_HSDTFIFOE: DMA request source select HSDTFIFOE
      \arg        DSI_DMA_REQ_SRC_HSDTFIFOF_INV: DMA request source select ~HSDTFIFOF
      \arg        DSI_DMA_REQ_SRC_LPDTFIFOHE: DMA request source select LPDTFIFOHE
      \arg        DSI_DMA_REQ_SRC_LPDTFIFOE: DMA request source select LPDTFIFOE
      \arg        DSI_DMA_REQ_SRC_LPDTFIFOF_INV: DMA request source select ~LPDTFIFOF
    \param[out] none
    \retval     none
*/
void dsi_dma_request_source_select(uint32_t source)
{
    DSI_WDMARCTL &= ~DSI_WDMARCTL_DMASRC;
    DSI_WDMARCTL |= source & DSI_WDMARCTL_DMASRC;
}

/*!
    \brief      initialize DSI WMS structure with default values (API_ID(0x005BU))
    \param[in]  none
    \param[out] wms_struct: DSI WMS parameter struct
    \retval     none
*/
void dsi_wms_struct_para_init(dsi_wms_parameter_struct *wms_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == wms_struct) {
        fw_debug_report_err(DSI_MODULE_ID, API_ID(0x005BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the WMS parameters with default values */
        wms_struct->wms_mode = DSI_WMS_MODE_HS;
        wms_struct->first_packet_header = 0U;
        wms_struct->second_packet_header = 0U;
        wms_struct->dcs_command = 0U;
        wms_struct->packet_length = 0U;
        wms_struct->total_length = 0U;
    }
}

/*!
    \brief      configure the DSI wrapper WMS parameters (API_ID(0x005CU))
    \param[in]  wms_struct: DSI WMS parameter struct
                  wms_mode: WMS mode, DSI_WMS_MODE_HS, DSI_WMS_MODE_LP
                  first_packet_header: first split packet head
                  second_packet_header: secondary split packet head
                  dcs_command: long packet DCS command
                  packet_length: packet length in words
                  total_length: total number of words to be transferred
    \param[out] none
    \retval     none
*/
void dsi_wms_config(dsi_wms_parameter_struct *wms_struct)
{
    uint32_t reg_val;

